app/controllers/posts_controller.rb

  def makinganewone
    @post = Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "img", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)